<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1eca533e73063f730667d85ba50be14e8c4da225a6fae4a0b75654d45172f532","plan_job_ref":"Job Terraform Plan #559 at https://github.com/cal-itp/data-infra/actions/runs/18145169201","plan_out_hash":"e8683ee6f66b5e666e2e04022f1146f8678841a209e64578682c41316c54d2f3","plan_hash":"19d132e63c018208330793593fa553d21a9d9f49595dda8bc41c9f7761fa2bce","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gke/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_container_cluster.sftp-endpoints will be created
+   resource "google_container_cluster" "sftp-endpoints" {
+       cluster_ipv4_cidr                        = (known after apply)
+       datapath_provider                        = (known after apply)
+       default_max_pods_per_node                = (known after apply)
+       deletion_protection                      = false
+       disable_l4_lb_firewall_reconciliation    = false
+       effective_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       enable_autopilot                         = true
+       enable_cilium_clusterwide_network_policy = false
+       enable_fqdn_network_policy               = false
+       enable_intranode_visibility              = true
+       enable_kubernetes_alpha                  = false
+       enable_l4_ilb_subsetting                 = false
+       enable_legacy_abac                       = false
+       enable_multi_networking                  = false
+       enable_shielded_nodes                    = true
+       endpoint                                 = (known after apply)
+       id                                       = (known after apply)
+       label_fingerprint                        = (known after apply)
+       location                                 = "us-west2"
+       logging_service                          = (known after apply)
+       master_version                           = (known after apply)
+       monitoring_service                       = (known after apply)
+       name                                     = "sftp-endpoints"
+       network                                  = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       networking_mode                          = "VPC_NATIVE"
+       node_locations                           = (known after apply)
+       node_version                             = (known after apply)
+       operation                                = (known after apply)
+       private_ipv6_google_access               = (known after apply)
+       project                                  = "cal-itp-data-infra"
+       self_link                                = (known after apply)
+       services_ipv4_cidr                       = (known after apply)
+       subnetwork                               = (known after apply)
+       terraform_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       tpu_ipv4_cidr_block                      = (known after apply)

+       addons_config {
+           cloudrun_config (known after apply)
+           config_connector_config (known after apply)
+           dns_cache_config (known after apply)
+           gce_persistent_disk_csi_driver_config (known after apply)
+           gcp_filestore_csi_driver_config (known after apply)
+           gcs_fuse_csi_driver_config {
+               enabled = true
            }
+           gke_backup_agent_config (known after apply)
+           horizontal_pod_autoscaling (known after apply)
+           http_load_balancing (known after apply)
+           network_policy_config (known after apply)
+           parallelstore_csi_driver_config (known after apply)
+           ray_operator_config (known after apply)
+           stateful_ha_config (known after apply)
        }

+       authenticator_groups_config (known after apply)

+       cluster_autoscaling (known after apply)

+       confidential_nodes (known after apply)

+       control_plane_endpoints_config (known after apply)

+       cost_management_config (known after apply)

+       database_encryption (known after apply)

+       default_snat_status (known after apply)

+       enterprise_config (known after apply)

+       gateway_api_config (known after apply)

+       identity_service_config (known after apply)

+       ip_allocation_policy (known after apply)

+       logging_config (known after apply)

+       master_auth (known after apply)

+       master_authorized_networks_config (known after apply)

+       mesh_certificates (known after apply)

+       monitoring_config (known after apply)

+       node_config {
+           disk_size_gb     = (known after apply)
+           disk_type        = (known after apply)
+           effective_taints = (known after apply)
+           image_type       = (known after apply)
+           labels           = (known after apply)
+           local_ssd_count  = (known after apply)
+           logging_variant  = (known after apply)
+           machine_type     = (known after apply)
+           metadata         = (known after apply)
+           min_cpu_platform = (known after apply)
+           oauth_scopes     = (known after apply)
+           preemptible      = false
+           service_account  = (known after apply)
+           spot             = false

+           confidential_nodes (known after apply)

+           gcfs_config (known after apply)

+           guest_accelerator (known after apply)

+           kubelet_config (known after apply)

+           shielded_instance_config (known after apply)

+           windows_node_config (known after apply)

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       node_pool (known after apply)

+       node_pool_auto_config (known after apply)

+       node_pool_defaults (known after apply)

+       notification_config (known after apply)

+       pod_autoscaling (known after apply)

+       release_channel (known after apply)

+       secret_manager_config {
+           enabled = true
        }

+       security_posture_config (known after apply)

+       service_external_ips_config (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "10m"
        }

+       vertical_pod_autoscaling (known after apply)

+       workload_identity_config {
+           workload_pool = "cal-itp-data-infra.svc.id.goog"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   google_container_cluster_sftp-endpoints_ca_certificate               = (sensitive value)
+   google_container_cluster_sftp-endpoints_endpoint                     = (known after apply)
+   google_container_cluster_sftp-endpoints_name                         = "sftp-endpoints"
```
</details>

:memo: Plan generated in [Terraform Plan #559](https://github.com/cal-itp/data-infra/actions/runs/18145169201)